<Header/>
<Main>
	<main>
		<p>Данные бот, сайт и другие связанные с ботом источники контента, далее — "системы", являются результатом творческой интеллектуальной деятельности человека.</p>
		<p>Их прямое или косвенное использование не является получением каких-либо услуг.</p>
		<p>Использование систем не подразумевает никаких гарантий, явных или подразумеваемых, в связи с контентом, который Вы можете увидеть или получить, включая условия товарной пригодности, пригодности для определенной цели, права собственности и ненарушения прав. Ни в коем случае мы не несем ответственности за любые прямые, косвенные, штрафные, особые или другие убытки, включая, помимо прочего, потерю или задержку использования, упущенную выгоду, потерю данных или любой другой ущерб по контракту, гражданскому правонарушению, праву справедливости или любому другому ущербу. другую теорию права, даже если о такой возможности было сообщено.</p>
		<p>Поскольку некоторые штаты/юрисдикции не допускают исключения или ограничения ответственности за косвенные или случайные убытки, это ограничение может частично не применяться к вам. ЕСЛИ ВЫ НЕУДОВЛЕТВОРЕНЫ ЛЮБОЙ ЧАСТЬЮ ЭТОЙ БОТА, САЙТА ИЛИ КАКИМ-ЛИБО ИЗ НАСТОЯЩИХ УСЛОВИЙ ИСПОЛЬЗОВАНИЯ, ВАШЕ ЕДИНСТВЕННОЕ И ИСКЛЮЧИТЕЛЬНОЕ СРЕДСТВО ЯВЛЯЕТСЯ ПРЕКРАТИТЬ ИСПОЛЬЗОВАНИЕ ЭТИХ СИСТЕМ.</p>
		<p>Используя одну из этих систем или их совокупность, вы соглашаетесь с данной политикой использования и можете нести ответственность за целенаправленный вред системам</p>
	</main>
</Main>


<style>
	main
	{
		display: flex;
		gap: 1em;
		flex-direction: column;
		justify-content: center;

		font-family: 'PTMono';
		background-color: var( --white );
		color: var( --dark );
		padding: 2em;
		border-radius: 15px;
	}
</style>


<script>
	import Header from '#site-component-lib/Layout/Header.svelte';
	import Main from '#site-component-lib/Layout/Main.svelte';


</script>
